{
    "title": "隐私政策",
    "updateDate": "更新于 2022 年 11 月 18 日",
    "content": "欢迎使用 Cierra_Runis 提供的 Mercurius 软件及服务。\n\n本次 Cierra_Runis 根据最新的《中华人民共和国网络安全法》、《信息安全技术个人信息安全规范》（GB/T 35273-2017）以及其他相关法律法规和技术规范编写了《Mercurius 隐私政策》（以下简称「本政策」），并增加 有《未成年人隐私保护声明》。\n\n为了更好的保护您的个人信息，请您仔细阅读本政策，如您对本政策有任何异议或疑问，您可通过本政策第十条中公布的联系方式与 Cierra_Runis 沟通。\n\n一、引言\n1. 本政策适用于 Mercurius 安卓端应用程序。\n2. 请您在使用 Mercurius 的服务前仔细阅读并充分理解本政策的全部内容。一旦您继续使用 Mercurius 软件及服务，即表示您已经同意 Cierra_Runis 按照本政策使用和处理您的相关信息。\n3. Cierra_Runis 会根据相关的法律法规不定时更新本政策，本政策在更新变动后，请确认本政策的新增内容。\n4. 请您同意并且理解只有您确认变更后的本政策，Cierra_Runis 才会依据更新变动后的本政策来收集、使用、储存、处理您的个人信息；您有权拒绝更新变更后的本政策。但请您知悉，一旦拒绝同意变更后的本政策将会导致您不能继续完整使用 Mercurius 相关服务和功能。\n5. 本政策主要向您说明：\n  - Cierra_Runis 收集的信息\n  - Cierra_Runis 如何使用这些信息\n\n二、关于 Cierra_Runis\n1. Mercurius 由 Cierra_Runis 个人提供产品运营和服务。\n2. Cierra_Runis 的基本信息如下：个人网站为 https://github.com/Cierra-Runis 。\n\n三、名词解释\n除非另有约定，本政策中使用到的名词，通常仅具有以下定义：\n\n1. 个人信息（出自于GB/T 35273-2017《信息安全技术个人信息安全规范》）\n- 是指以电子或者其他方式记录的能够单独或者与其他信息结合识别特定自然人身份或者反映特定自然人活动情况的各种信息。本政策中涉及的个人信息包括自然人的基本资料（包括姓名、生日、性别、住址、电话号码、电子邮箱）、个人身份信息（包括身份证件号码）、个人生物识别信息（包括指纹、面部特征）、网络身份标识信息（包括系统账号、IP地址、邮箱地址以及与前述有关的密码、口令、口令保护答案）、个人财产信息（包括银行账号、口令、交易和消费记录、虚拟货币、虚拟交易、兑换码等虚拟财产信息）、通讯录信息、个人上网记录（包括网站浏览记录、软件使用记录）、个人常用设备信息（包括硬件序列号、硬件型号、设备MAC地址、操作系统类型、软件列表、唯一设备标识符）、个人位置信息（包括大概地理位置、精确定位信息）。\n- Cierra_Runis 实际具体收集的个人信息种类以下文描述为准。\n\n2. 个人敏感信息（出自于GB/T 35273-2017《信息安全技术个人信息安全规范》）\n- 是指一旦泄露、非法提供或滥用可能危害人身和财产安全，极易导致个人名誉、身心健康受到损害或歧视性待遇等的个人信息。本政策中涉及的个人敏感信息包括您的个人财产信息、个人身份信息（包括身份证件号码）、个人生物识别信息、网络身份标识信息、通讯录信息、精准定位信息、收货地址。\n- Cierra_Runis 实际具体收集的个人敏感信息种类以下文描述为准。\n\n3. 设备\n- 是指可用于访问 Cierra_Runis 的产品和服务的装置，例如台式计算机、笔记本电脑、平板电脑或智能手机。\n\n4. 唯一设备标识符（专属 ID 或 UUID）\n- 是指由设备制造商编入到设备中的一串字符，可用于以独有方式标识相应设备（例如手机的 IMEI 号）。唯一设备标识符有多种用途，其中可在不能使用 Cookie（例如在移动应用程序中）时用以提供广告。\n\n5. IP 地址\n- 每台上网的设备都会指定一个编号，称为互联网协议地址（即 IP 地址）。这些编号通常都是根据地理区域指定的。IP 地址通常可用于识别设备连接至互联网时所在的位置。\n\n6. SSL\n- SSL（Secure Socket Layer）又称为安全套接层，是在传输通信协议（TCP/IP）上实现的一种安全协议。SSL 支持各种类型的网络，同时提供三种基本的安全服务，均通过使用公开密钥和对称密钥技术以达到信息保密的效果。\n\n7. Cookie\n- Cookie是包含字符串的小文件，在您登入和使用网站或其他网络内容时发送、存放在您的计算机、移动设备或其他装置内（通常经过加密）。Cookie 同类技术是可用于与Cookie类似用途的其他技术，例如 Web Beacon、Proxy、嵌入式脚本等。\n\n8. 账号\n- 当您注册账号并向 Cierra_Runis 提供一些个人信息，您就可以更好的使用 Cierra_Runis 的服务。\n\n9. 去标识化/匿名化\n- 是指通过对个人信息的技术处理，使其在不借助额外信息 的情况下，无法识别个人信息主体，且处理后的信息不能被复原的过程。\n\n10. 服务器日志\n- 通常情况下，Cierra_Runis 的服务器会自动记录您在访问网站时所发出的网页请求。这些服务器日志通常包括您的网络请求、互联网协议地址、浏览器类型、浏览器语言、请求的日期和时间及可以唯 一识别您的浏览器的一个或多个 Cookie。\n\n四、Cierra_Runis 收集的信息\n\n1. Cierra_Runis 根据合法、正规、必要的原则，仅收集为了能实现产品功能所需要的必要信息，除此之外 Cierra_Runis 不会收集您的其余信息。\n\n2. Cierra_Runis 主要收集您的个人信息包括两种：\n- Cierra_Runis 产品或服务所需要的必要信息，此类信息为产品或服务正常运行的必备信息，您需授权提供 Cierra_Runis 收集。您有权拒绝 Cierra_Runis 收集。但请悉知这会导致您无法使用 Cierra_Runis 的产品或服务。\n- 附加功能可能需要用到的信息，此类信息为非核心功能所需要的信息，您可 以授权是否授权 Cierra_Runis 采集。如果您拒绝，可能将会导致您享受的服务无法达到 Cierra_Runis 拟达到的效果，但不影响您对核心功能的正常使用。\n\n3. 通常情况下 Cierra_Runis 会在以下场景收集和使用您的个人信息：\n- 您在注册账号时所填写的信息。\n\n  例如，您在注册 Mercurius 账号时所填写的邮箱、年龄、性别。\n\n- 您在使用服务时上传的信息。\n\n  例如，头像、用户名等。\n\n  同时，您需理解，手机号码或电子邮箱地址属于您的个人敏感信息，Cierra_Runis 收集该类信息是基于法律法规的相关要求，如您拒绝提供可能导致您无法注册账号并使用相关产 品功能，请您谨慎考虑后再选择是否提供。\n\n- 您参加 Cierra_Runis 举办的活动时。\n\n  例如，您参与 Cierra_Runis 线上活动时填写的调查问卷中可能包含您的姓名、电话等信息。\n\n  Cierra_Runis 的部分服务可能需要您提供特定的个人敏感信息来实现特定功能。若您选择不提供该类 信息，则可能无法正常使用服务中的特定功能，但不影响您使用服务中的其他功能。若您主动提供您的个人敏感信息，即表示您同意 Cierra_Runis 按本政策所述目的和方式来处理您的个人敏感信息。\n\n- 联系 Cierra_Runis 时。\n\n  例如，您在使用服务中遇见了一些问题需要寻找 Cierra_Runis 来处理，这时您需要提供邮箱、用户名、联系方式等信息。\n\n- 支付过程时。\n\n  例如，当您在 Mercurius 发生支付行为时，需要使用到支付功能。\n\n  在支付过程中，Cierra_Runis 可能会收集您的第三方支付渠道的 user ID （例如支付宝user ID、微信open ID、QQ钱包open ID或银行卡信息）（个人敏感信息）。上述信息为 Cierra_Runis 向您提供您购买商品和（或）服务所必须的信息，Cierra_Runis 无法仅根据该信息获得您的个人财产信息，也不能识别特定自然人身份信息。\n\n- 使用上传服务时。\n\n  例如，您使用了文本上传服务，Cierra_Runis 会把您上传的文本储存在云端，您可以根据需要随时删除在云端的文本，Cierra_Runis 不能泄露用户在云端中上传的文本。\n\n- 为了帮助您更好地使用 Cierra_Runis 的产品或服务时。\n\n  例如，Cierra_Runis 会征求您的授权来获取对于软件的反馈。\n\n五、Cierra_Runis 如何使用这些信息\n1. 为了确保服务的安全，帮助 Cierra_Runis 更好地了解 Cierra_Runis 应用程序的运行情况，Cierra_Runis 可能记录相关信息，例如，您使用应用程序的频率、故障信息、总体使用情况、性能数据以及应用程序的来源。Cierra_Runis 不会将 Cierra_Runis 存储在分析软件中的信息与您在应用程序中提供的个人身份信息相结合。\n- 产品开发和服务优化，当 Cierra_Runis 的系统出现问题发生故障的时候 Cierra_Runis 会记录和分析故障时产生的信息，优化 Cierra_Runis 的服务。\n- Cierra_Runis 会用到您的信息在身份验证上，例如您丢失了您的账号寻找客服人员帮助时，客服人员会使用您在注 册账号时填写的信息来对您进行身份验证。\n- Cierra_Runis 可能会因为版本的迭代来邀请您参与 Cierra_Runis 的服务调查。\n\n六、信息安全\n1. Cierra_Runis 会为您的个人信息安全提供相应的安全保证以防止账号被他人不正当使用，Cierra_Runis 严格遵守法律法规保护用户的私人信息，例如使用加密技术（TLS、SSL等）、匿名化处理等手段来保护您的个人信息。\n2. Cierra_Runis 建立了专门的管理制度来确保您的信息安全，例如，Cierra_Runis 会严格限制访问信息的人员范围，要求他们遵守保密义务，并进行审查。如果发生个人信息泄露等安全事件，Cierra_Runis 会启动应急预案阻止事态进一步的加深，并且及时发布公告让您及时了解到事态的进展情况。\n\n七、用户信息\n1. 总览\n- 您可以通过 Cierra_Runis 的服务分享您的相关信息。需注意的地方是，由于 Mercurius 产品的特性，您在使用过程中匹配的对象信息应自觉遵守相应的法律法规，不得在没有经过他人允许的情况下擅自复制、发布、保存他人的敏感信息。\n- 您可以通过设置权限来阻止信息的泄露。但请您注意，这些信息仍可能由其他用户或不受 Cierra_Runis 控制的非关联第三方独立地保存。\n- 如您发现 Cierra_Runis 违反法律、行政法规的规定或者双方的约定收集、使用您的个人信息，您可以要求 Cierra_Runis 删除。如您发现 Cierra_Runis 收集、存储的您的个人信息有错误的，您也可以要求 Cierra_Runis 更正。\n- 请通过本政策列明的联系方式与 Cierra_Runis 联系。请您理解，由于技术所限、法律或监管要求，Cierra_Runis 可能无法满足您的所有要求，Cierra_Runis 会在合理的期限内答复您的请求。\n2. 注销账户\n- 如您需要注销账户，请您找到注销入口后，提交注销申请。Mercurius 会审核您所发布过的个人信息，确认无相关争议后完成注销。\n- 在注销账户之后，Cierra_Runis 将停止为您提供产品或服务，并依据您的要求，删除您的个人信息，但法律法规另有规定的除外。\n\n八、Cierra_Runis 对未成年人的保护\n1. 未成年人使用 Cierra_Runis 的产品与或服务前应取得其监护人的同意。如您为未成年人，在使用 Cierra_Runis 的产品或服务前，应在监护人监护、指导下共同阅读本政策且应在监护人明确同意和指导下使用 Cierra_Runis 的产品或服务、提交个人信息。Cierra_Runis 根据国家相关法律法规的规定保护未成年人的个人信息，只会在法律法规允许、监护人明确同意或保护您的权益所必要的情况下收集、使用或公开披露未成年人的个人信息。\n2. 若您是未成年人的监护人，当您对您所监护的未成年人的个人信息有相关疑问时，您可以通过本政策第十条中公示的联系方式与 Cierra_Runis 沟通解决。如果 Cierra_Runis 发现在未事先获得可证实的监护人同意的情况下收集了未成年人的个人信息，则会尽快删除相关数据。\n\n九、适用范围\n1. Cierra_Runis 所有的服务都适用于本政策。若本政策与特定服务的隐私指引或声明有不一致之处，请以本政策为准。\n\n十、联系 Cierra_Runis\n1. 如您对本政策的内容或使用 Cierra_Runis 的服务时遇到的与隐私保护相关的事宜有任何疑问或进行咨询或投诉时，您均可以通过如下任一方式与 Cierra_Runis 取得联系：\n- 您可找到 Mercurius 反馈页面中提 交反馈意见\n- 您可以写邮件至 byrdsaron@gmail.com\n2. Cierra_Runis 会在收到消息的 30 个工作日内回复，但是望您悉知，如果发生和个人信息有关的以下情形，Cierra_Runis 将无法回复您的请求：\n- 与国家安全、国防安全有关的；\n- 与重大公共利益有关的；\n- 与犯罪侦查、起诉和 审判等有关的；\n- 有充分证据表明您存在恶意行为的；\n- 涉及商业秘密的；\n- 法律法规等规定的其他情形。\n- 对社会可能会造成不良影响的。",
    "link": {}
}