import 'index.dart';

const String _agreementContent = '''
欢迎使用 Cierra_Runis 提供的 Mercurius 软件及服务。

请仔细阅读以下条款，如果您对本协议中的任何条款表示异议，您可以选择停止使用 Mercurius 。若您使用 Mercurius 提供的服务，或在 Mercurius 中发布任何内容（即「内容」），均视为您（即「用户」）完全接受本协议项下的全部条款。

一、使用规则
1. Mercurius 将给予每个用户一个用户帐号及相应的密码，该用户帐号和密码由用户负责保管；用户应当对以其用户帐号进行的所有活动和事件负法律责任。
2. 用户须对在 Mercurius 的注册信息的真实性、合法性、有效性承担全部责任，用户不得冒充他人；不得利用他人的名义发布任何信息；不得恶意使用注册帐号导致其他用户误认；否则 Mercurius 有权立即停止提供服务，收回其帐号并由用户独自承担由此而产生的一切法律责任。
3. 用户直接或通过各类方式间接使用 Mercurius 服务和数据的行为，都将被视作已无条件接受本协议全部内容；若用户对本协议的任何条款存在异议，请停止使用 Mercurius 所提供的全部服务。
4. Mercurius 是一个信息分享、传播及获取的平台，用户通过 Mercurius 发表的信息为公开的信息，其他第三方均可以通过 Mercurius 获取用户发表的信息，用户对任何信息的发表即认可该信息为公开的信息，并单独对此行为承担法律责任；任何用户不愿被其他第三人获知的信息都不应该在 Mercurius 上进行发表。
5. 用户承诺不得以任何方式利用 Mercurius 直接或间接从事违反中国法律以及社会公德的行为，Mercurius 有权对违反上述承诺的内容予以删除。
6. 用户不得利用 Mercurius 服务制作、上载、复制、发布、传播或者转载如下内容：
　　1. 反对中华人民共和国宪法所确定的基本原则的；
　　2. 危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；
　　3. 损害国家荣誉和利益的；
　　4. 煽动民族仇恨、民族歧视，破坏民族团结的；
　　5. 侮辱、滥用英烈形象，否定英烈事迹，美化粉饰侵略战争行为的；
　　6. 破坏国家宗教政策，宣扬邪教和封建迷信的；
　　7. 散布谣言，扰乱社会秩序，破坏社会稳定的；
　　8. 散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；
　　9. 侮辱或者诽谤他人，侵害他人合法权益的；
　　10. 宣扬、教唆使用外挂、私服以及木马的相关内容的；
　　11. 发布任何经本平台合理判断为不妥当或者本平台未认可的软件、文件等在内的主页地址或者链接的；
　　12. 含有中华人民共和国法律、行政法规禁止的其他内容的信息。
如果用户在使用本服务过程中违反了相关法律法规或本协议约定，相关国家机关或机构可能会对您提起诉讼、罚款或采取其他制裁措施，并要求 Cierra_Runis 给予协助。用户应自行承担全部责任，Cierra_Runis 不承担任何责任。
7. Mercurius 有权对用户使用 Mercurius 的情况进行审查和监督，如用户在使用 Mercurius 时违反任何上述规定，Mercurius 或其授权的人有权要求用户改正或直接采取一切必要的措施（包括但不限于更改或删除用户上传的内容、暂停或终止用户使用 Mercurius 的权利）以减轻用户不当行为造成的影响。

二、Cierra_Runis 的义务
1. Cierra_Runis 同意通过互联网络根据本协议约定，为用户提供 Cierra_Runis 的 Mercurius 软件及服务。
2. Cierra_Runis 保存增值服务的兑换记录，保存期限为自用户兑换之日起 180 日。
3. 在使用 Cierra_Runis 增值服务的过程中，用户有权向 Cierra_Runis 要求协助调取兑换记录和转移记录，Cierra_Runis 应要求用户提供并核实与其注册身份信息相一致的个人有效身份信息或证明，核实用户所提供的个人有效身份信息或证明与所注册的身份信息相一致的，应当予以协助提供。用户没有提供其个人有效身份信息或证明，或者用户提供的个人有效身份信息或证明与所注册的身份信息不一致的，Cierra_Runis 有权拒绝用户前述请求。

三、用户的义务
1. 用户应自行准备上网所需的设备（如电脑、手机等电子设备）。
2. 用户应自行负担使用服务过程中的流量、电信、网络使用等费用。
3. 遵守本协议的约定、其他相关规则和制度的规定服务条款；遵守中华人民共和国相关法律法规。

四、免责声明
1. Mercurius 不能对用户上传内容的正确性进行保证。
2. 用户在 Mercurius 发表的内容仅表明其个人的立场和观点，并不代表 Mercurius 的立场或观点。作为内容的发表者，需自行对所发表内容负责，因所发表内容引发的一切纠纷，由该内容的发表者承担全部法律及连带责任。 Mercurius 不承担任何法律及连带责任。
3. Mercurius 不保证网络服务一定能满足用户的要求，也不保证网络服务不会中断，对网络服务的及时性、安全性、准确性也都不作保证。
4. 对于因不可抗力或 Mercurius 不能控制的原因造成的网络服务中断或其它缺陷，Mercurius 不承担任何责任，但将尽力减少因此而给用户造成的损失和影响。

五、知识产权声明
1. Cierra_Runis 依法享有服务的一切合法权益包括但不限于其中涉及的计算机软件著作权、美术作品著作权和专利权等知识产权等，或已从合法权利人处取得合法授权从而有权为用户提供 Cierra_Runis 相关服务。
2. Cierra_Runis 提供的服务可能涉及第三方知识产权，如该第三方对用户在 Cierra_Runis 服务中使用该知识产权有要求的，用户应当遵守该等要求。
3. 本协议未明确授予用户的权利均由 Cierra_Runis 保留。
4. 用户不得修改、改编、翻译 Cierra_Runis 服务所使用的软件、技术、材料等，或者创作与之相关的派生作品，不得通过反向工程、反编译、反汇编或其他类似行为获得其的源代码，否则由此引起的一切法律后果由用户负责，Cierra_Runis 将依法追究违约方的法律责任。
5. 用户不得擅自删除、掩盖或更改 Cierra_Runis 的版权声明。

六、协议修改
1. 根据互联网的发展和有关法律、法规及规范性文件的变化，或者因业务发展需要，Mercurius 有权对本协议的条款作出修改或变更，一旦本协议的内容发生变动，Mercurius 将会直接在 Mercurius 软件内公布修改之后的协议内容，该公布行为视为 Mercurius 已经通知用户修改内容。Mercurius 也可采用电子邮件或私信的传送方式，提示用户协议条款的修改、服务变更、或其它重要事项。
2. 根据互联网的发展和有关法律、法规及规范性文件的变化，或者因业务发展需要，Mercurius 有权对本协议的条款作出修改或变更，一旦本协议的内容发生变动，Mercurius 将会直接在 Mercurius 软件内公布修改之后的协议内容，该公布行为视为 Mercurius 已经通知用户修改内容。Mercurius 也可采用电子邮件或私信的传送方式，提示用户协议条款的修改、服务变更、或其它重要事项。

七、用户传播的信息与投诉处理
1. 用户通过 Cierra_Runis 提供的服务发送或传播的信息包括但不限于文字、图片、链接均由用户自行承担责任。
2. 用户发送或者传播的内容应当有合法的来源，传播的相关内容应为用户所有或者用户获得了授权。
3. 如果用户发送或传播的内容违法、违规或侵犯他人权利的，Cierra_Runis 有权根据实际情况采取删除原内容、冻结用户账号等措施。
4. 如果用户被其他用户举报或用户举报他人，视情况考量后，Cierra_Runis 有权将争议中相关方的主体信息、联系方式、投诉相关内容等必要信息提供给相关当事方或相关部门，以便及时解决投诉纠纷，保护各方合法权益。
5. 用户应保证在举报处理程序中提供的信息、材料、证据等的真实性、合法性、有效性负责。

八、用户所提供内容的知识产权及授权
1. Cierra_Runis 尊重知识产权并注重保护用户享有的各项权利。在参与 Cierra_Runis 的服务中，用户可能需要通过上传、发布等各种方式 Cierra_Runis 提供内容。在此情况下，用户仍然享有此等内容的完整知识产权。
2. 用户在此明确同意，您在提供前述内容的同时，不可撤销地授予本平台及其关联公司一项全球性的、永久的免费许可，允许 Cierra_Runis 使用、传播、展示此等内容。

九、法律适用和管辖
1. 本协议的生效、履行、解释及争议的解决均适用中华人民共和国法律。本条款因与中华人民共和国现行法律相抵触而导致部分无效，不影响其他部分的效力。双方同意，解决争议时，应以您同意的最新版用户协议为准。
2. 如果就本协议内容发生或执行产生任何争议，应本着友好协商的态度解决；协商不顺利时，则争议各方均一致同意将争议提交到相关司法部门按照其程序进行。裁决为一裁终局，对各方均有法律约束力。

十、未成年人使用条款
1. Cierra_Runis 十分注重未成年人的身心发展的健康。若用户为未成年人，应在监护人监护、指导下阅读本协议，并在取得监护人的同意后使用 Cierra_Runis 的产品和服务。
2. 监护人应指导子女上网应该注意的安全问题，防患于未然。Cierra_Runis 不鼓励未成年人在服务中有不合适的消费行为，如有消费，未成年人应请监护人操作或在监护人明示同意下操作。
3. 对于未成年人的隐私保护，Cierra_Runis 将严格按照公布的《隐私政策》中阐述的方式执行。
4. 未成年人用户涉世未深，面对信息时代爆炸的信息量容易被网络虚像信息所迷惑，处理事态的方法还不够成熟同时缺乏自我保护的能力，容易被别有用心的人利用。因此，未成年人用户在使用本服务时应注意以下事项，提高安全意识，加强自我保护：
　　1. 分辨出网络与现实的界限，不要沉迷于网络影响日常的学习生活。
　　2. 填写个人资料时需要提高警惕，加强个人保护意识，以免不法分子对个人生活造成骚扰。
　　3. 应在监护人或老师的指导下，正确使用网络。
　　4. 避免与陌生网友随意会面或参与联谊活动，以免不法分子有机可乘，危及自身安全。

十一、其他约定
1. 本协议所有条款的标题仅为方便阅读，本身并无实际涵义，不能作为本协议及相关条款涵义解释的依据。
2. 如本协议中的任何条款因任何原因被判定为完全或部分无效或不具有执行力的，本协议的其他条款仍应有效并有执行力。
3. Cierra_Runis 不行使、未能及时行使或者未充分行使本协议或者按照法律规定所享有的权利，不应被视为放弃该权利，也不影响 Cierra_Runis 在未来行使该权利。
4. 如果用户对本协议或本服务有意见或建议，可与 Cierra_Runis 取得联系（https://github.com/Cierra-Runis），我们会给予用户必要的帮助。
''';

class AgreementWidget extends StatefulWidget {
  const AgreementWidget({super.key});

  @override
  State<AgreementWidget> createState() => _AgreementWidgetState();
}

class _AgreementWidgetState extends State<AgreementWidget> {
  @override
  Widget build(BuildContext context) {
    return AlertDialog(
      title: Column(
        mainAxisSize: MainAxisSize.min,
        crossAxisAlignment: CrossAxisAlignment.start,
        children: <Widget>[
          const Text('Mercurius 用户协议'),
          Text(
            '更新于 2022 年 10 月 25 日',
            style: TextStyle(
              fontSize: 10,
              color: (Theme.of(context).brightness == Brightness.dark)
                  ? Colors.white54
                  : Colors.black54,
            ),
          ),
        ],
      ),
      content: ListView(
        children: const <Widget>[
          Text(_agreementContent),
        ],
      ),
      actions: <Widget>[
        TextButton(
          style: TextButton.styleFrom(
            textStyle: Theme.of(context).textTheme.labelLarge,
          ),
          child: const Text('返回'),
          onPressed: () {
            Navigator.of(context).pop();
          },
        ),
      ],
      actionsPadding: const EdgeInsets.fromLTRB(8, 0, 8, 8),
    );
  }
}
